"""
Создать текстовый файл (не программно), построчно записать фамилии сотрудников и
величину их окладов (не менее 10 строк). Определить, кто из сотрудников имеет оклад менее
© geekbrains.ru 23
[ 'C:\\Users\\Администратор\\Desktop' , 'C:\\Users' , 'C:\\Python37\\python37.zip' ,
'C:\\Python37\\DLLs' , 'C:\\Python37\\lib' , 'C:\\Python37' ,
'C:\\Python37\\lib\\site-packages' ]
import sys
print(sys.platform)
win32
20 тыс., вывести фамилии этих сотрудников. Выполнить подсчет средней величины дохода
сотрудников.
Пример файла:
Иванов 23543.12
Петров 13749.32
"""

